Tekla Open API Reference for Tekla Structures 2025
OBB.Intersects Method (GeometricPlane)
 Tests if current OBB intersects with the given GeometricPlane
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Intersects(
	GeometricPlane geometricPlane
)
Public Function Intersects (
	geometricPlane As GeometricPlane
) As Boolean
Parameters
geometricPlane
Type: Tekla.Structures.Geometry3d.GeometricPlane
GeometricPlane to test against
Return Value
Type: Boolean
True if the OBB intersects with the given GeometricPlane, otherwise false
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is assigned to the geometricPlane parameter.
See Also
Reference
OBB Class
Intersects Overload
Tekla.Structures.Geometry3d Namespace